Repository: giellalt/corpus-smj
Catalog: tmx/sma/admin/depts/other_files/laereplan_engelsk.html.tmx
Source language: smj
Languages: sma

source: åvddånbuktet ja sagástallat ájggeguovddelis ássjijt ieŋŋilskgielak gáldojs
sma: sjyöhtehke saernieh åehpiedehtedh jïh digkiedidh eengelskegïelen gaaltijijstie

source: ságastallat ieŋŋilskgiela åvddånime birra væráltgiellan
sma: sjïdtedimmiem eengelsken gïeleste digkiedidh goh akte veartenegïele

source: ságastallat duon dán ieŋŋilskgielak girjálasj tevstaj birra duot dát væráltguovlos
sma: ovmessie såarhts eengelskegïelen lidteræære tjaalegh digkiedidh ovmessie bielijste veartenistie

source: ságastallat ieŋŋilskgielak filmaj ja ietjá kultuvrraåvddånbuktemij birra duot dát medijás
sma: eengelskegïelen filmh jïh jeatjah kultuvrelahtesh digkiedidh ovmessie meedijijstie

source: ságastallat iemeálmmugij ja iemeálmmugij tevstaj birra ieŋŋilskgielak rijkajn
sma: tjaalegh digkiedidh aalkoealmetjijstie jïh aalkoealmetji bïjre eengelskegïelen laantine

source: ietjas tjiegŋodit fágalasj ássjijn ietjas åhpadusprográmma milta ja åvddånbuktet dav ássjev
sma: aktem faageles aamhtesem goerehtidh jïjtse ööhpehtimmieprogrammen sisnjelen jïh dam åehpiedehtedh

source: Árvustallam fágan
sma: Faagem vierhtiedidh

source: Åbbålasj árvustallam
sma: Eksamene learoehkidie

source: 10. jahkedásse
sma: Jaepiedaltese

source: Oahppe soajtti vuorbbáduvvat tjálalasj eksábmaj.
sma: Learohkh maehtieh tjaaleldh eksamenese geasalgidh.

source: Tjálalasj eksábma dagáduvvá ja árvustaláduvvá guovdálattjat.
sma: Tjaaleldh eksamene dorjesåvva jïh sensureradamme sjædta byögkeles sijjesne.

source: Oahppe soajtti vuorbbáduvvat njálmálasj eksábmaj.
sma: Learohkh maehtieh aaj njaalmeldh eksamenese geasalgidh.

source: Njálmálasj eksábma bájkálattjat dagáduvvá ja sensureriduvvá.
sma: Njaalmeldh eksamene gietskene dorjesåvva jïh sensureradamme sjædta.

source: Jo1 oahppogárvedime åhpadusprográmma
sma: Jåa1 studijeryöjreden ööhpehtimmieprogrammh

source: Jo2 viddnofágalasj åhpadusprográmma
sma: Jåa2 barkoefaageles ööhpehtimmieprogrammh

source: Oahppe soajtti aj vuorbbáduvvat njálmálasj eksábmaj.
sma: Learohkh maehtieh aaj njaalmeldh eksamenese geasalgidh.

source: Eksábmaj gullu ålles fáhka (140 timer).
sma: Eksamene abpe faagem feerhmie (140 tæjmoeh).

source: Gehtja doajmme årnigav ållessjattugij vuodoskåvllååhpadusán.
sma: Vuartesjh sïejhme öörnegem maadthskuvlelïerehtæmman geerve almetjidie.

source: Privatista galggi tjadádit tjálalasj ja njálmálasj eksámav.
sma: Privatisth edtjieh tjaaleldh jïh njaalmeldh eksamenem vaeltedh.

source: Njálmálasj eksábma bájkálattjat dagáduvvá ja árvustaláduvvá.
sma: Njaalmeldh eksamene gietskene dorjesåvva jïh sensureradamme sjædta.

source: Árvustallama dábálasj mærrádusá li mierreduvvam åhpaduslága njuolgadustjállagin.
sma: Dah sïejhme nænnoestimmieh vuarjasjimmien bïjre lea vihtiestamme ööhpehtimmielaaken mieriedimmesne
